### Imports

In [ ]:
import pandas as pd
import numpy as np

### Definindo DataFrame

In [ ]:
df = pd.read_csv('adult.data.csv')

### Verificando Tamanhos

In [ ]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educationnum',
       'maritalstatus', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'nativecountry',
       'result'],
      dtype='object')

In [ ]:
df.shape

(32561, 15)

## **Pré-Processamentos**

Retirando education da tabela

In [ ]:
df.drop(['education'], axis=1, inplace=True)

In [ ]:
df.head(3)

   age         workclass  fnlwgt  ...  hours-per-week  nativecountry result
0   39         State-gov   77516  ...              40  United-States  <=50K
1   50  Self-emp-not-inc   83311  ...              13  United-States  <=50K
2   38           Private  215646  ...              40  United-States  <=50K

[3 rows x 14 columns]

In [ ]:
df.shape

(32561, 14)

### Removendo os dados faltantes

In [ ]:
df['occupation'].unique()

array(['Adm-clerical', 'Exec-managerial', 'Handlers-cleaners',
       'Prof-specialty', 'Other-service', 'Sales', 'Craft-repair',
       'Transport-moving', 'Farming-fishing', 'Machine-op-inspct',
       'Tech-support', '?', 'Protective-serv', 'Armed-Forces',
       'Priv-house-serv'], dtype=object)

In [ ]:
df['occupation'].value_counts()

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
?                    1843
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

In [ ]:
df['occupation'].nunique()

15

In [ ]:
df_remove = df.loc[(df['occupation'] == '?')]

In [ ]:
df_remove

       age workclass  fnlwgt  ...  hours-per-week  nativecountry result
27      54         ?  180211  ...              60          South   >50K
61      32         ?  293936  ...              40              ?  <=50K
69      25         ?  200681  ...              40  United-States  <=50K
77      67         ?  212759  ...               2  United-States  <=50K
106     17         ?  304873  ...              32  United-States  <=50K
...    ...       ...     ...  ...             ...            ...    ...
32530   35         ?  320084  ...              55  United-States   >50K
32531   30         ?   33811  ...              99  United-States  <=50K
32539   71         ?  287372  ...              10  United-States   >50K
32541   41         ?  202822  ...              32  United-States  <=50K
32542   72         ?  129912  ...              25  United-States  <=50K

[1843 rows x 14 columns]

In [ ]:
df= df.drop(df_remove.index)

In [ ]:
df['occupation'].nunique()

14

In [ ]:
df.shape

(30718, 14)

In [ ]:
df['occupation'].value_counts()

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

Verificar colunas em object ou int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30718 entries, 0 to 32560
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             30718 non-null  int64
 1   workclass       30718 non-null  object
 2   fnlwgt          30718 non-null  int64
 3   educationnum    30718 non-null  int64
 4   maritalstatus   30718 non-null  object
 5   occupation      30718 non-null  object
 6   relationship    30718 non-null  object
 7   race            30718 non-null  object
 8   sex             30718 non-null  object
 9   capital-gain    30718 non-null  int64
 10  capital-loss    30718 non-null  int64
 11  hours-per-week  30718 non-null  int64
 12  nativecountry   30718 non-null  object
 13  result          30718 non-null  object
dtypes: int64(6), object(8)
memory usage: 3.5+ MB

## Utilizando **map** para conversão dos objetos

Verificando os dados

In [ ]:
df['sex'].unique()

array(['Male', 'Female'], dtype=object)

In [ ]:
df['sex'].value_counts()

Male      20788
Female     9930
Name: sex, dtype: int64

Rodando a função map para subistituir Objetos por números Inteiros

In [ ]:
df['sex'] = df.sex.map({'Female':2, 'Male':1})

In [ ]:
df.head(2)

   age         workclass  fnlwgt  ...  hours-per-week  nativecountry result
0   39         State-gov   77516  ...              40  United-States  <=50K
1   50  Self-emp-not-inc   83311  ...              13  United-States  <=50K

[2 rows x 14 columns]

In [ ]:
df['result'] = df.result.map({'<=50K':1, '>50K':2})

In [ ]:
df.head(2)

   age         workclass  fnlwgt  ...  hours-per-week  nativecountry result
0   39         State-gov   77516  ...              40  United-States      1
1   50  Self-emp-not-inc   83311  ...              13  United-States      1

[2 rows x 14 columns]

In [ ]:
df['nativecountry'].unique()

array(['United-States', 'Cuba', 'Jamaica', 'India', '?', 'Mexico',
       'Puerto-Rico', 'Honduras', 'England', 'Canada', 'Germany', 'Iran',
       'Philippines', 'Poland', 'Columbia', 'Cambodia', 'Thailand',
       'Ecuador', 'Laos', 'Taiwan', 'Haiti', 'Portugal',
       'Dominican-Republic', 'El-Salvador', 'France', 'Guatemala',
       'Italy', 'China', 'South', 'Japan', 'Yugoslavia', 'Peru',
       'Outlying-US(Guam-USVI-etc)', 'Scotland', 'Trinadad&Tobago',
       'Greece', 'Nicaragua', 'Vietnam', 'Hong', 'Ireland', 'Hungary',
       'Holand-Netherlands'], dtype=object)

In [ ]:
df['nativecountry'].value_counts()

United-States                 27504
Mexico                          610
?                               556
Philippines                     188
Germany                         128
Puerto-Rico                     109
Canada                          107
El-Salvador                     100
India                           100
Cuba                             92
England                          86
Jamaica                          80
South                            71
China                            68
Italy                            68
Dominican-Republic               67
Vietnam                          64
Guatemala                        63
Japan                            59
Columbia                         56
Poland                           56
Iran                             42
Haiti                            42
Taiwan                           42
Portugal                         34
Nicaragua                        33
Peru                             30
Greece                           29
Ecuador                          27
France                           27
Ireland                          24
Hong                             19
Trinadad&Tobago                  18
Cambodia                         18
Laos                             17
Thailand                         17
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Hungary                          13
Honduras                         12
Scotland                         11
Holand-Netherlands                1
Name: nativecountry, dtype: int64

In [ ]:
df_remove_native = df.loc[(df['nativecountry'] == '?')]

In [ ]:
df_remove_native

       age         workclass  fnlwgt  ...  hours-per-week nativecountry result
14      40           Private  121772  ...              40             ?      2
38      31           Private   84154  ...              38             ?      2
51      18           Private  226956  ...              30             ?      1
93      30           Private  117747  ...              35             ?      1
245     56           Private  203580  ...              35             ?      1
...    ...               ...     ...  ...             ...           ...    ...
32413   45           Private  199590  ...              40             ?      1
32449   44      Self-emp-inc   71556  ...              50             ?      2
32469   58      Self-emp-inc  181974  ...              99             ?      1
32492   42  Self-emp-not-inc  217597  ...              50             ?      1
32510   39           Private  107302  ...              45             ?      2

[556 rows x 14 columns]

In [ ]:
df= df.drop(df_remove_native.index)

In [ ]:
df['nativecountry'].unique()

array(['United-States', 'Cuba', 'Jamaica', 'India', 'Mexico',
       'Puerto-Rico', 'Honduras', 'England', 'Canada', 'Germany', 'Iran',
       'Philippines', 'Poland', 'Columbia', 'Cambodia', 'Thailand',
       'Ecuador', 'Laos', 'Taiwan', 'Haiti', 'Portugal',
       'Dominican-Republic', 'El-Salvador', 'France', 'Guatemala',
       'Italy', 'China', 'South', 'Japan', 'Yugoslavia', 'Peru',
       'Outlying-US(Guam-USVI-etc)', 'Scotland', 'Trinadad&Tobago',
       'Greece', 'Nicaragua', 'Vietnam', 'Hong', 'Ireland', 'Hungary',
       'Holand-Netherlands'], dtype=object)

In [ ]:
df['nativecountry'].sort_values().unique()

array(['Cambodia', 'Canada', 'China', 'Columbia', 'Cuba',
       'Dominican-Republic', 'Ecuador', 'El-Salvador', 'England',
       'France', 'Germany', 'Greece', 'Guatemala', 'Haiti',
       'Holand-Netherlands', 'Honduras', 'Hong', 'Hungary', 'India',
       'Iran', 'Ireland', 'Italy', 'Jamaica', 'Japan', 'Laos', 'Mexico',
       'Nicaragua', 'Outlying-US(Guam-USVI-etc)', 'Peru', 'Philippines',
       'Poland', 'Portugal', 'Puerto-Rico', 'Scotland', 'South', 'Taiwan',
       'Thailand', 'Trinadad&Tobago', 'United-States', 'Vietnam',
       'Yugoslavia'], dtype=object)

In [ ]:
df['nativecountry'] = df.nativecountry.map({'Cambodia':1, 'Canada':2, 'China':3, 'Columbia':4, 'Cuba':5, 'Dominican-Republic':6, 'Ecuador':7, 'El-Salvador':8, 'England':9, 'France':10, 'Germany':11, 'Greece':12, 'Guatemala':13, 'Haiti':14, 'Holand-Netherlands':15, 'Honduras':16, 'Hong':17, 'Hungary':18, 'India':19, 'Iran':20, 'Ireland':12, 'Italy':22, 'Jamaica':23, 'Japan':24, 'Laos':25, 'Mexico':26, 'Nicaragua':27, 'Outlying-US(Guam-USVI-etc)':28, 'Peru':29, 'Philippines':30, 'Poland':31, 'Portugal':32, 'Puerto-Rico':33, 'Scotland':34, 'South':35, 'Taiwan':36, 'Thailand':37, 'Trinadad&Tobago':38, 'United-States':39, 'Vietnam':40, 'Yugoslavia':41})

In [ ]:
df.head(2)

   age         workclass  fnlwgt  ...  hours-per-week nativecountry result
0   39         State-gov   77516  ...              40            39      1
1   50  Self-emp-not-inc   83311  ...              13            39      1

[2 rows x 14 columns]

In [ ]:
df['race'].sort_values().unique()

array(['Amer-Indian-Eskimo', 'Asian-Pac-Islander', 'Black', 'Other',
       'White'], dtype=object)

In [ ]:
df['race'] = df.race.map({'Amer-Indian-Eskimo':1, 'Asian-Pac-Islander':2, 'Black':3, 'Other':4, 'White':5})

In [ ]:
df.head(2)

   age         workclass  fnlwgt  ...  hours-per-week nativecountry result
0   39         State-gov   77516  ...              40            39      1
1   50  Self-emp-not-inc   83311  ...              13            39      1

[2 rows x 14 columns]

In [ ]:
df['relationship'].sort_values().unique()

array(['Husband', 'Not-in-family', 'Other-relative', 'Own-child',
       'Unmarried', 'Wife'], dtype=object)

In [ ]:
df['relationship'] = df.relationship.map({'Husband':1, 'Not-in-family':2, 'Other-relative':3, 'Own-child':4, 'Unmarried':5, 'Wife':6})

In [ ]:
df.head(2)

   age         workclass  fnlwgt  ...  hours-per-week nativecountry result
0   39         State-gov   77516  ...              40            39      1
1   50  Self-emp-not-inc   83311  ...              13            39      1

[2 rows x 14 columns]

In [ ]:
df['maritalstatus'].sort_values().unique()

array(['Divorced', 'Married-AF-spouse', 'Married-civ-spouse',
       'Married-spouse-absent', 'Never-married', 'Separated', 'Widowed'],
      dtype=object)

In [ ]:
df['maritalstatus'] = df.maritalstatus.map({'Divorced':1, 'Married-AF-spouse':2, 'Married-civ-spouse':3, 'Married-spouse-absent':4, 'Never-married':5, 'Separated':6, 'Widowed':7})

In [ ]:
df.head(2)

   age         workclass  fnlwgt  ...  hours-per-week  nativecountry result
0   39         State-gov   77516  ...              40             39      1
1   50  Self-emp-not-inc   83311  ...              13             39      1

[2 rows x 14 columns]

In [ ]:
df['workclass'].sort_values().unique()

array(['Federal-gov', 'Local-gov', 'Private', 'Self-emp-inc',
       'Self-emp-not-inc', 'State-gov', 'Without-pay'], dtype=object)

In [ ]:
df['workclass'] = df.workclass.map({'Federal-gov':1, 'Local-gov':2, 'Private':3, 'Self-emp-inc':4, 'Self-emp-not-inc':5, 'State-gov':6, 'Without-pay':7})

In [ ]:
df.head(2)

   age  workclass  fnlwgt  ...  hours-per-week  nativecountry result
0   39          6   77516  ...              40             39      1
1   50          5   83311  ...              13             39      1

[2 rows x 14 columns]

In [ ]:
df['occupation'].sort_values().unique()

array(['Adm-clerical', 'Armed-Forces', 'Craft-repair', 'Exec-managerial',
       'Farming-fishing', 'Handlers-cleaners', 'Machine-op-inspct',
       'Other-service', 'Priv-house-serv', 'Prof-specialty',
       'Protective-serv', 'Sales', 'Tech-support', 'Transport-moving'],
      dtype=object)

In [ ]:
df['occupation'] = df.occupation.map({'Adm-clerical':1, 'Armed-Forces':2, 'Craft-repair':3, 'Exec-managerial':4, 'Farming-fishing':5, 'Handlers-cleaners':6, 'Machine-op-inspct':7, 'Other-service':8, 'Priv-house-serv':9, 'Prof-specialty':10, 'Protective-serv':11, 'Sales':12, 'Tech-support':13, 'Transport-moving':14})

In [ ]:
df.head(2)

   age  workclass  fnlwgt  ...  hours-per-week  nativecountry  result
0   39          6   77516  ...              40             39       1
1   50          5   83311  ...              13             39       1

[2 rows x 14 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30162 entries, 0 to 32560
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             30162 non-null  int64
 1   workclass       30162 non-null  int64
 2   fnlwgt          30162 non-null  int64
 3   educationnum    30162 non-null  int64
 4   maritalstatus   30162 non-null  int64
 5   occupation      30162 non-null  int64
 6   relationship    30162 non-null  int64
 7   race            30162 non-null  int64
 8   sex             30162 non-null  int64
 9   capital-gain    30162 non-null  int64
 10  capital-loss    30162 non-null  int64
 11  hours-per-week  30162 non-null  int64
 12  nativecountry   30162 non-null  int64
 13  result          30162 non-null  int64
dtypes: int64(14)
memory usage: 3.5 MB

In [ ]:
df.head(9)

   age  workclass  fnlwgt  ...  hours-per-week  nativecountry  result
0   39          6   77516  ...              40             39       1
1   50          5   83311  ...              13             39       1
2   38          3  215646  ...              40             39       1
3   53          3  234721  ...              40             39       1
4   28          3  338409  ...              40              5       1
5   37          3  284582  ...              40             39       1
6   49          3  160187  ...              16             23       1
7   52          5  209642  ...              45             39       2
8   31          3   45781  ...              50             39       2

[9 rows x 14 columns]